# pandas数据读取

In [1]:
import numpy as np
import pandas as pd

In [2]:
#通过read_csv读取csv文件
data = pd.read_csv('data1.csv')
data

    name  age    sex
0    joe   18    men
1  susan   19    NaN
2   anne   20  women

In [3]:
data2 = pd.read_excel('data2.xlsx')
data2

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

In [4]:
#读取文本、
# data3 = pd.read_csv('data3.txt',sep = ';',header =None)
data3 = pd.read_csv('data3.txt',sep = ';')
data3

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

# pandas数据过滤

In [5]:
data3['语文'] = [70,82.5,90]
data3['数学'] = [72,83.5,88]
data3['英语'] = [72,np.NaN,88]

print(data3.columns)
data3

Index(['name', 'age', 'sex', '语文', '数学', '英语'], dtype='object')

    name  age    sex    语文    数学    英语
0    joe   18    men  70.0  72.0  72.0
1  susan   19  women  82.5  83.5   NaN
2   anne   20  women  90.0  88.0  88.0

In [6]:
data3 = data3[data3.columns[3:]]
data3

     语文    数学    英语
0  70.0  72.0  72.0
1  82.5  83.5   NaN
2  90.0  88.0  88.0

# 缺失值得处理办法

In [7]:
#删除NaN的行
data3 = data3.dropna()
data3

     语文    数学    英语
0  70.0  72.0  72.0
2  90.0  88.0  88.0

In [13]:
dict = {
    'name':['joe','susan','black'],
    'age':[19,19,20],
    'sex':['men','women','men'],
    'classid':1
}
df03 = pd.DataFrame(dict,index = ['one','two','three'])
df03['address'] = np.NaN
df03.loc['four'] = np.NaN
print(df03)

        name   age    sex  classid  address
one      joe  19.0    men      1.0      NaN
two    susan  19.0  women      1.0      NaN
three  black  20.0    men      1.0      NaN
four     NaN   NaN    NaN      NaN      NaN

In [9]:
#isnull notnull
print(df03.isnull())
print(df03.notnull())

         age  classid   name    sex  address
one    False    False  False  False     True
two    False    False  False  False     True
three  False    False  False  False     True
four    True     True   True   True     True
         age  classid   name    sex  address
one     True     True   True   True    False
two     True     True   True   True    False
three   True     True   True   True    False
four   False    False  False  False    False

In [19]:
# df03.loc['one','address'] = '上海'
# print(df03)
# df03.dropna()#默认删除只要包含NaN得行
df04 = df03.dropna(how = 'all', axis = 1)  #之丢弃全部为NaN的数据
df03.loc['four','name'] = 'jack'
print(df04)
df04 = df03.dropna(axis = 1)#丢弃包含NaN的列
df04

        name   age    sex  classid
one      joe  19.0    men      1.0
two    susan  19.0  women      1.0
three  black  20.0    men      1.0
four    jack   NaN    NaN      NaN

        name
one      joe
two    susan
three  black
four    jack

In [11]:
df04 = pd.DataFrame(np.random.randint(1,5,size = (5,3)))
df04.loc[1:3,1] = np.NaN
df04.loc[1:2,2] = np.NaN
df04

   0    1    2
0  1  4.0  3.0
1  2  NaN  NaN
2  4  NaN  NaN
3  2  NaN  2.0
4  2  3.0  2.0

In [12]:
#使用0填充数据
df04 = df04.fillna(0)
df04

   0    1    2
0  1  4.0  3.0
1  2  0.0  0.0
2  4  0.0  0.0
3  2  0.0  2.0
4  2  3.0  2.0

In [13]:
#向前填充
df04 = df04.fillna(method = 'ffill')
df04

   0    1    2
0  1  4.0  3.0
1  2  0.0  0.0
2  4  0.0  0.0
3  2  0.0  2.0
4  2  3.0  2.0

In [14]:
#向后填充
df04 = df04.fillna(method = 'bfill')
df04

   0    1    2
0  1  4.0  3.0
1  2  0.0  0.0
2  4  0.0  0.0
3  2  0.0  2.0
4  2  3.0  2.0

In [15]:
#替换填充
df04 = df04.fillna({1:100,2:'-1'})
df04

   0    1    2
0  1  4.0  3.0
1  2  0.0  0.0
2  4  0.0  0.0
3  2  0.0  2.0
4  2  3.0  2.0

# 常用统计函数

In [43]:
score = pd.DataFrame(np.random.randint(60,100,size = (4,3)),columns = ['语文','数学','英语'])
score

   语文  数学  英语
0  97  81  90
1  81  66  85
2  66  65  77
3  89  93  62

In [44]:
score.describe()

              语文        数学         英语
count   4.000000   4.00000   4.000000
mean   83.250000  76.25000  78.500000
std    13.225606  13.35103  12.233833
min    66.000000  65.00000  62.000000
25%    77.250000  65.75000  73.250000
50%    85.000000  73.50000  81.000000
75%    91.000000  84.00000  86.250000
max    97.000000  93.00000  90.000000

In [45]:
score.count()

语文    4
数学    4
英语    4
dtype: int64

In [46]:
score.min(axis = 1)
score.min()

语文    66
数学    65
英语    62
dtype: int32

In [47]:
score.idxmin()

语文    2
数学    2
英语    3
dtype: int64

In [48]:
score.idxmax()

语文    0
数学    3
英语    0
dtype: int64

In [49]:
score.sum(axis = 1)
score.sum()

语文    333
数学    305
英语    314
dtype: int64

In [53]:
#值得平均数
score.mean()
# score.mean(axis = 1)

语文    83.25
数学    76.25
英语    78.50
dtype: float64

In [51]:
#值得中位数
score.median()

语文    85.0
数学    73.5
英语    81.0
dtype: float64

In [52]:
#跟据平均值计算平均绝对距离差
score.mad()

语文     9.75
数学    10.75
英语     9.00
dtype: float64

In [54]:
#样本数值得方差
score.var()

语文    174.916667
数学    178.250000
英语    149.666667
dtype: float64

In [57]:
#标准差
score.std(axis = 0)

语文    13.225606
数学    13.351030
英语    12.233833
dtype: float64

In [61]:
#样本值得累计和
score.cumsum()
score.cummin()
score.cummax()
score.cumprod()

         语文        数学        英语
0        97        81        90
1      7857      5346      7650
2    518562    347490    589050
3  46152018  32316570  36521100

In [64]:
score.pct_change(1)

         语文        数学        英语
0       NaN       NaN       NaN
1 -0.164948 -0.185185 -0.055556
2 -0.185185 -0.015152 -0.094118
3  0.348485  0.430769 -0.194805